app/Controllers/Agenda.php

    public function index()
    {
        $dataAllAgenda = $this->agenda->get()->resultID->num_rows;
        // dd($dataAllAgenda);
        $data = [
            'title' => 'Agenda',
            'dataAllAgenda' => $dataAllAgenda,
            'todayAgenda' => $this->show_agenda_today()
        ];
        $data['home'] = $this->agenda->findAll();
---
SELECT *
FROM `agenda`

    public function create()
    {



        $data = [
            'nama_agenda' => $this->request->getPost('nama_agenda'),
            'asal_surat' => $this->request->getPost('asal_surat'),
            'no_surat' => $this->request->getPost('no_surat'),
            'no_bkad' => $this->request->getPost('no_bkad'),
            'tgl' => $this->request->getPost('tgl'),
            'waktu' => $this->request->getPost('waktu'),
            'tempat' => $this->request->getPost('tempat'),
            'disposisi' => $this->request->getPost('disposisi'),
            'catatan' => $this->request->getPost('catatan'),
            'notulensi' => $this->request->getPost('notulensi'),
        ];

        $data['disposisi'] = implode(", ", $data['disposisi']);

        $this->agenda->insert($data);
---
INSERT INTO `agenda` (`nama_agenda`, `asal_surat`, `no_surat`, `no_bkad`, `tgl`, `tempat`, `disposisi`, `catatan`, `notulensi`) VALUES ('rapat tahunan', 'bpk', '12356467', '123561237', '2023-02-13T20:21', 'medan', 'Kabid Anggaran, Kabid Akuntansi', 'harap untuk hadir', 'diharapkan untuk hadir')

    public function edit($id)
    {

        $session = session();

        if ($session->get('role') === "admin") {
            $data = [
                'notulensi' => $this->request->getPost('notulensi')
            ];
        } else {
            $data = [
                'nama_agenda' => $this->request->getPost('nama_agenda'),
                'asal_surat' => $this->request->getPost('asal_surat'),
                'no_surat' => $this->request->getPost('no_surat'),
                'no_bkad' => $this->request->getPost('no_bkad'),
                'tgl' => $this->request->getPost('tgl'),
                'waktu' => $this->request->getPost('waktu'),
                'tempat' => $this->request->getPost('tempat'),
                'disposisi' => $this->request->getPost('disposisi'),
                'catatan' => $this->request->getPost('catatan'),
                'notulensi' => $this->request->getPost('notulensi'),
            ];

            $data['disposisi'] = implode(", ", $data['disposisi']);
        }

        $this->agenda->update($id, $data);
---
UPDATE `agenda` SET `nama_agenda` = 'rapat tahunan', `asal_surat` = 'bpk', `no_surat` = '12356467', `no_bkad` = '123561237', `tgl` = '2023-02-13T20:21', `tempat` = 'medan', `disposisi` = 'Kabid Anggaran, Kabid Akuntansi', `catatan` = 'harap untuk hadir KELEN YA', `notulensi` = 'diharapkan untuk hadir'
WHERE `agenda`.`id` IN ('21')