app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `pengguna_email` = ''
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $model = new \App\Models\PenggunaModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('pengguna_email', $email)->first();