app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $model = new \App\Models\PenggunaModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('pengguna_username', $email)->first();
---
SELECT *
FROM `pengguna`
WHERE `pengguna_username` = 'ari'
 LIMIT 1