app/Controllers/Home.php

    public function index()
    {
        $data['home'] = $this->agenda->findAll();
        $data['dataAllAgenda'] = $this->agenda->get()->resultID->num_rows;
---
SELECT *
FROM `agenda`

    public function create()
    {
        $this->agenda->insert([
            'nama_agenda' => $this->request->getPost('nama_agenda'),
            'asal_surat' => $this->request->getPost('asal_surat'),
            'no_surat' => $this->request->getPost('no_surat'),
            'no_bkad' => $this->request->getPost('no_bkad'),
            'tgl' => $this->request->getPost('tgl'),
            'waktu' => $this->request->getPost('waktu'),
            'tempat' => $this->request->getPost('tempat'),
            'disposisi' => $this->request->getPost('disposisi'),
            'catatan' => $this->request->getPost('catatan'),
            'notulensi' => $this->request->getPost('notulensi'),
        ]);

        return redirect('agenda')->with('success', 'Data Added Successfully');
---
SELECT *
FROM `agenda`