app/Models/AgendaModel.php

    public function dateSame()
    {
        $db      = \Config\Database::connect();
        $date_now = date("Y-m-d");

        $builder = $db->table($this->table);
        $agenda  = $builder->get();
---
SELECT *
FROM `agenda`